In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!

In [4]:
df = pd.read_sql_query('SELECT f.name, '
'SUM(Revenue.cost) AS totalrevenue '
'FROM Facilities f '
'INNER JOIN (SELECT f2.facid, f2.name, '
            'CASE WHEN b.memid = 0 THEN (slots * guestcost) '
            'ELSE (slots * membercost) END AS cost '
            'FROM Facilities f2 '
            'INNER JOIN Bookings b on b.facid = f2.facid) AS Revenue '
'ON f.facid = Revenue.facid '
'GROUP BY f.name '
'HAVING totalrevenue < 1000 ', engine)
df.head()

            name  totalrevenue
0     Pool Table           270
1  Snooker Table           240
2   Table Tennis           180

 Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

In [16]:
df = pd.read_sql_query('SELECT m1.firstname, m1.surname, ' 
 "CASE WHEN m1.recommendedby <> 0 THEN (m2.firstname || ' ' || m2.surname) "
 "ELSE 'None' END AS recommender FROM Members m1 "
'LEFT JOIN Members m2 ON m1.recommendedby = m2.memid '
'ORDER BY m1.surname, m1.firstname', engine)
df.head()

  firstname  surname      recommender
0  Florence    Bader  Ponder Stibbons
1      Anne    Baker  Ponder Stibbons
2   Timothy    Baker   Jemima Farrell
3       Tim   Boothe       Tim Rownam
4    Gerald  Butters     Darren Smith

Q12: Find the facilities with their usage by member, but not guests

In [18]:
df = pd.read_sql_query ('SELECT f.name, COUNT(b.bookid) AS timesbooked '
'FROM Facilities f '
'INNER JOIN Bookings b on b.facid = f.facid '
'WHERE b.memid <> 0 '
'GROUP BY f.name', engine)
df.head()

              name  timesbooked
0  Badminton Court          344
1   Massage Room 1          421
2   Massage Room 2           27
3       Pool Table          783
4    Snooker Table          421

Q13: Find the facilities usage by month, but not guests

In [21]:
df = pd.read_sql_query("SELECT f.name, strftime('%m', b.starttime) AS month, COUNT(b.bookid) AS timesbooked "
'FROM Facilities f '
'INNER JOIN Bookings b on b.facid = f.facid '
'WHERE b.memid <> 0 '
'GROUP BY f.name, month', engine)
df.head()

              name month  timesbooked
0  Badminton Court    07           51
1  Badminton Court    08          132
2  Badminton Court    09          161
3   Massage Room 1    07           77
4   Massage Room 1    08          153